#batch_size=1
main_input = Input(shape=(20,), dtype='float64') #time_step=20

# 词嵌入（使用预训练的词向量）
embedder = Embedding(256, 300, input_length = 20)
embed = embedder(main_input) #进过embed之后变为20*300

# # 词窗大小分别为3,4,5
cnn1 = Convolution1D(256, 3, padding='same', strides = 1, activation='relu')(embed) #卷积后变为20*256
cnn1 = MaxPool1D(pool_size=4)(cnn1) #池化后变为5*256
cnn2 = Convolution1D(256, 4, padding='same', strides = 1, activation='relu')(embed) #卷积后变为20*256
cnn2 = MaxPool1D(pool_size=4)(cnn2) #池化后变为5*256
cnn3 = Convolution1D(256, 5, padding='same', strides = 1, activation='relu')(embed) #卷积后变为20*256
cnn3 = MaxPool1D(pool_size=4)(cnn3) #池化后变为5*256

# 合并三个模型的输出向量
cnn = concatenate([cnn1,cnn2,cnn3], axis=-1) #拼接后变成5*768
flat = Flatten()(cnn) #展平变成 3840
drop = Dropout(0.2)(flat)
main_output = Dense(10, activation='softmax')(drop)
model = Model(inputs = main_input, outputs = main_output) #最后输出10
model.summary()

summary 如下所示

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_18 (InputLayer)           (None, 20)           0                                            
__________________________________________________________________________________________________
embedding_14 (Embedding)        (None, 20, 300)      76800       input_18[0][0]                   
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 20, 256)      230656      embedding_14[0][0]               
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 20, 256)      307456      embedding_14[0][0]               
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 20, 256)      384256      embedding_14[0][0]               
__________________________________________________________________________________________________
max_pooling1d_20 (MaxPooling1D) (None, 5, 256)       0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_21 (MaxPooling1D) (None, 5, 256)       0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_22 (MaxPooling1D) (None, 5, 256)       0           conv1d_23[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 5, 768)       0           max_pooling1d_20[0][0]           
                                                                 max_pooling1d_21[0][0]           
                                                                 max_pooling1d_22[0][0]           
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 3840)         0           concatenate_4[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 3840)         0           flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           38410       dropout_2[0][0]                  
==================================================================================================
Total params: 1,037,578
Trainable params: 1,037,578
Non-trainable params: 0
__________________________________________________________________________________________________
